

const configMenu = [
  {
    name: 'แดชบอร์ด',
    url: '/home/dashboard'
  },
  // {
  //   name: 'รายงาน',
  //   url: '/report',
  //   children: [
  //     { name: 'ยอดขายประจำปี', url: '/report' },
  //     { name: 'ยอดขายประจำเดือน', url: '/report' },
  //     { name: 'ยอดขายประจำสัปดาฬ', url: '/report' },
  //   ]
  // },
  // { name: 'รายงานยอดขายประจำปี' }, // show price per month, can select month, default is correct month of year
  // { name: 'รายงานยอดขายประจำเดือน' }, // show price per week, can select week, default is correct week of month
  // { name: 'รายงานยอดขายประจำสัปดาฬ' }, // show price per day, can select day, default is correct day of week
  {
    name: 'ลูกค้า',
    url: '/home/member',
    // children: [
    //   { name: 'เพิ่มลูกค้าใหม่', url: '/report' },
    //   { name: 'ข้อมูลลูกค้า', url: '/report' },
    //   { name: 'ค้นหาข้อมูลลูกค้า', url: '/report' },
    // ]
  },

  {
    name: 'ออเดอร์สินค้า',
    url: '/home/order',
    // children: [
    //   { name: 'เพิ่มสั่งชื้อสินค้าใหม่', url: '/order/add' },
    //   { name: 'รายการออเดอร์ทั้งหมด', url: '/order/list' },
    //   { name: 'ค้นหาใบสั่งซื้อ', url: '/order/search' },
    //   { name: 'ออกใบสั่งซื้อ', url: '/order/bill' },
    // ]
  },
  // { name: 'เพิ่มรายการสั่งชื้อสินค้าใหม่' },
  // { name: 'ค้นหา ใบสั่งซื้อ' },
  // { name: 'ออก ใบสั่งซื้อ' },

  // { name: 'การสั่งจอง สินค้า' },
  // { name: 'ข้อมูลการจองสินค้า' }, // จองเมื่อ สิ้นค้า หมด หรือ ไม่มีอยู่ในสต็อค และ จะเป็นไปเป็นการ สั่งชื้อ (sssss) auto เมื่อมี สินค้าเข้ามาใหม่
  // { name: 'อัพเดทสถานะการจอง' }, // อาจจะโทร คอมเฟริม กับ ลูกค้าอีกที เมื่อมีการโหลด สินค้าเข้ามาแล้ว
  // { name: 'ออกเลิกการจอง' },
  // { name: 'ค้นหา ใบจองสินค้า' }, // อาจจะใช้เลขทีจองเดียวกันกับ เลขที่ใบสั่งชื้อ

  // { name: 'ลูกค้า' },
  // { name: 'เพิ่มลูกค้าใหม่' },
  // { name: 'ข้อมูลลูกค้า' },
  // { name: 'ค้นหาข้อมูลลูกค้า' },


  {
    name: 'สินค้า',
    url: '/home/product',
    // children: [
    //   { name: 'ข้อมูลสินค้า', url: '/report' },
    //   { name: 'เพิ่มข้อมูลสินค้าใหม่', url: '/report' },
    //   { name: 'หมวดหมู่', url: '/report' },
    // ]
  },
  // { name: 'สินค้า' },
  // { name: 'ข้อมูลสินค้า' },
  // { name: 'เพิ่มข้อมูลสินค้าใหม่' },
  // { name: 'หมวดหมู่' },

  // Stock

  {
    name: 'สต๊อก',
    url: '/home/stock',
    // children: [
    //   { name: 'ข้อมูลสินค้าคงคลัง', url: '/report' },
    //   { name: 'รายการนำเข้าสินค้า', url: '/report' },
    //   { name: 'รายการส่งออกสินค้า', url: '/report' },
    //   { name: 'โหลดสินค้าเข้าสต๊อก', url: '/report' },
    //   { name: 'กำหนดการสั่งชื้อสินค้า', url: '/report' },
    //   { name: 'สินค้าขาออก', url: '/report' },
    // ]
  },
  // { name: 'สต๊อก' },
  // { name: 'ข้อมูลสินค้าคงคลัง' }, // ดูทั้งหมด มีทั้งหมด เข้า ออก เหลือ
  // { name: 'รายการนำเข้าสินค้า' }, // เข้า
  // { name: 'รายการส่งออกสินค้า' }, // ออก
  // { name: 'โหลดสินค้าเข้าสต๊อก' }, // load product to stock
  // { name: 'กำหนดการสั่งชื้อสินค้าเข้าสต๊อก' }, // กรณีสั่งจอง นำเข้าล้วงหน้า
  // { name: 'สินค้าขาออก' }, TODO maybe dup with menu sssss

  // {
  //   name: 'การจัดส่ง',
  //   url: '/sssss',
  //   children: [
  //     { name: 'ข้อมูลการจัดส่ง', url: '/report' },
  //     { name: 'การเบิกสินค้าเพื่อจัดส่ง', url: '/report' },
  //     { name: 'อัพเดทสถานะการจัดส่ง', url: '/report' },
  //     { name: 'ตารางเวลาการจัดส่ง', url: '/report' },
  //   ]
  // },
  // { name: 'การจัดส่ง' },
  // { name: 'ข้อมูลการจัดส่ง' },
  // { name: 'การเบิกสินค้าเพื่อจัดส่ง' }, // ยกสินค้า พร้อมกับ อัพเดทสถานะจัดส่ง
  // { name: 'อัพเดทสถานะการจัดส่ง' },
  // { name: 'ตารางเวลาการจัดส่ง' },


  // {
  //   name: 'การเงิน',
  //   url: '/sssss',
  //   children: [
  //     { name: 'ข้อมูลการเงิน', url: '/report' },
  //     { name: 'ข้อมูลชำระเงินของลูกค้า', url: '/report' },
  //     { name: 'แจ้งโอนชำระเงิน', url: '/report' },
  //     { name: 'การเบิกจ่ายสินค้านำเข้า', url: '/report' },
  //     { name: 'บันทึกค่าใช้จ่ายอื่นๆ', url: '/report' },
  //     // { name: 'ค้นหาใบกำกับภาษี', url: '/report' },
  //     // { name: 'ออกใบกำกับภาษี', url: '/report' },
  //   ]
  // },
  // { name: 'การเงิน และ บัญชี' },
  // { name: 'ข้อมูลการเงิน' }, // ดูการไหลเสียนทั้งหมด กำไร
  // { name: 'การเบิกจ่ายสินค้านำเข้า' }, // รายการจ่ายเงินชื้อของนำเข้า
  // { name: 'บันทึกค่าใช้จ่ายอื่นๆ' }, // รายการจ่ายเงินชื้อของนำเข้า
  // { name: 'ข้อมูลชำระเงินของลูกค้า' },
  // { name: 'แจ้งยอดโอนเงินของลูกค้า' },
  // { name: 'ค้นหาใบกำกับภาษี' },
  // { name: 'ออกใบกำกับภาษี' },
  {
    divider: true
  },
  {
    divider: true
  },
  // {
  //   name: 'การกำหนดสิทธิ์ผู้ใช้',
  //   url: '/sssss',
  // },
  // {
  //   name: 'การตั้งค่า',
  //   url: '/sssss',
  // },
  {
    name: 'การสำรองข้อมูล',
    url: '/login',
  },
  {
    name: 'ออกจากระบบ',
    url: '/login',
  },

  // { name: 'การกำหนดสิทธิ์ผู้ใช้' },
  // { name: 'การตั้งค่า' },
  // { name: 'การสำรองข้อมูล' },
  // { name: 'ออกจากระบบ' },
]


export default {
  items: configMenu
}
